<a href="https://colab.research.google.com/github/brunotagoncalves/bimbo-compassers/blob/main/kaggle_api_1st_read.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Notebook para Download e Leitura Inicial de Arquivos

1) Instalação e Download de Arquivos Kaggle

In [12]:
# Podem  ocorrrer falhas de instalação como lxml, mas isso não atrapalha o restante do código
!pip install -q kaggle
!pip install -q kaggle-cli

  Building wheel for lxml (setup.py) ... error
  ERROR: Failed building wheel for lxml
    Running setup.py install for lxml ... error
ERROR: Command errored out with exit status 1: /usr/bin/python3 -u -c 'import sys, setuptools, tokenize; sys.argv[0] = '"'"'/tmp/pip-install-d6jzktj4/lxml/setup.py'"'"'; __file__='"'"'/tmp/pip-install-d6jzktj4/lxml/setup.py'"'"';f=getattr(tokenize, '"'"'open'"'"', open)(__file__);code=f.read().replace('"'"'\r\n'"'"', '"'"'\n'"'"');f.close();exec(compile(code, __file__, '"'"'exec'"'"'))' install --record /tmp/pip-record-t5kke0x8/install-record.txt --single-version-externally-managed --compile Check the logs for full command output.

In [13]:
# Alterando arquivo de config do Kaggle com dados pessoais https://www.kaggle.com/"username"/account  crie um token pessoal no botão "create new api token"
!echo '{"username":"bruno9tg","key":"702cbacb35b74aaf6cf1ac91c6883b5a"}' > ~/.kaggle/kaggle.json

In [14]:
#utiliza api kaggle para realizar download
!kaggle competitions download -c grupo-bimbo-inventory-demand

Warning: Your Kaggle API key is readable by other users on this system! To fix this, you can run 'chmod 600 /root/.kaggle/kaggle.json'
Warning: Looks like you're using an outdated API Version, please consider updating (server 1.5.12 / client 1.5.4)
producto_tabla.csv.zip: Skipping, found more recently modified local copy (use --force to force download)
sample_submission.csv.zip: Skipping, found more recently modified local copy (use --force to force download)
town_state.csv.zip: Skipping, found more recently modified local copy (use --force to force download)
test.csv.zip: Skipping, found more recently modified local copy (use --force to force download)
cliente_tabla.csv.zip: Skipping, found more recently modified local copy (use --force to force download)
train.csv.zip: Skipping, found more recently modified local copy (use --force to force download)

2) Leitura básica dos arquivos

In [1]:
import pandas as pd

In [3]:
!ls

cliente_tabla.csv.zip	sample_submission.csv.zip  train.csv.zip
producto_tabla.csv.zip	test.csv.zip
sample_data		town_state.csv.zip

In [4]:
pd.read_csv('cliente_tabla.csv.zip').head()

   Cliente_ID                            NombreCliente
0           0                               SIN NOMBRE
1           1                         OXXO XINANTECATL
2           2                               SIN NOMBRE
3           3                                EL MORENO
4           4  SDN SER  DE ALIM  CUERPO SA CIA  DE INT

In [5]:
pd.read_csv('producto_tabla.csv.zip').head()

   Producto_ID                          NombreProducto
0            0                       NO IDENTIFICADO 0
1            9               Capuccino Moka 750g NES 9
2           41  Bimbollos Ext sAjonjoli 6p 480g BIM 41
3           53          Burritos Sincro 170g CU LON 53
4           72     Div Tira Mini Doradita 4p 45g TR 72

In [6]:
pd.read_csv('sample_submission.csv.zip').head()

   id  Demanda_uni_equil
0   0                  7
1   1                  7
2   2                  7
3   3                  7
4   4                  7

In [7]:
pd.read_csv('test.csv.zip').head()

   id  Semana  Agencia_ID  Canal_ID  Ruta_SAK  Cliente_ID  Producto_ID
0   0      11        4037         1      2209     4639078        35305
1   1      11        2237         1      1226     4705135         1238
2   2      10        2045         1      2831     4549769        32940
3   3      11        1227         1      4448     4717855        43066
4   4      11        1219         1      1130      966351         1277

In [8]:
pd.read_csv('town_state.csv.zip').head()

   Agencia_ID                   Town             State
0        1110     2008 AG. LAGO FILT      MÉXICO, D.F.
1        1111  2002 AG. AZCAPOTZALCO      MÉXICO, D.F.
2        1112    2004 AG. CUAUTITLAN  ESTADO DE MÉXICO
3        1113     2008 AG. LAGO FILT      MÉXICO, D.F.
4        1114   2029 AG.IZTAPALAPA 2      MÉXICO, D.F.

In [17]:
# Para os dados de treino o volume já excede a memoria do Colab usar a função iterator se faz necessário.
sample_train = pd.read_csv('train.csv.zip', nrows=1000)
sample_train

     Semana  Agencia_ID  ...  Dev_proxima  Demanda_uni_equil
0         3        1110  ...          0.0                  3
1         3        1110  ...          0.0                  4
2         3        1110  ...          0.0                  4
3         3        1110  ...          0.0                  4
4         3        1110  ...          0.0                  3
..      ...         ...  ...          ...                ...
995       3        1110  ...          0.0                 25
996       3        1110  ...          0.0                  6
997       3        1110  ...          0.0                  1
998       3        1110  ...          0.0                  2
999       3        1110  ...          0.0                  6

[1000 rows x 11 columns]

3) Instalação de Leitura com SPARK

In [16]:
!apt-get install openjdk-8-jdk-headless -qq > /dev/null
!wget http://www-eu.apache.org/dist/spark/spark-2.4.7/spark-2.4.7-bin-hadoop2.7.tgz

--2021-05-17 02:04:07--  http://www-eu.apache.org/dist/spark/spark-2.4.7/spark-2.4.7-bin-hadoop2.7.tgz
Resolving www-eu.apache.org (www-eu.apache.org)... 95.216.26.30, 2a01:4f9:2a:1a61::2
Connecting to www-eu.apache.org (www-eu.apache.org)|95.216.26.30|:80... connected.
HTTP request sent, awaiting response... 302 Found
Location: https://downloads.apache.org/spark/spark-2.4.7/spark-2.4.7-bin-hadoop2.7.tgz [following]
--2021-05-17 02:04:07--  https://downloads.apache.org/spark/spark-2.4.7/spark-2.4.7-bin-hadoop2.7.tgz
Resolving downloads.apache.org (downloads.apache.org)... 135.181.214.104, 88.99.95.219, 135.181.209.10, ...
Connecting to downloads.apache.org (downloads.apache.org)|135.181.214.104|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 233333392 (223M) [application/x-gzip]
Saving to: ‘spark-2.4.7-bin-hadoop2.7.tgz’

spark-2.4.7-bin-had 100%[===================>] 222.52M  17.8MB/s    in 14s

2021-05-17 02:04:21 (16.3 MB/s) - ‘spark-2.4.7-bin-hadoop2.7.tgz’ saved [233333392/233333392]

In [18]:
!tar -xf spark-2.4.7-bin-hadoop2.7.tgz
!pip install -q findspark
!pip install -q pyspark

     |████████████████████████████████| 212.3MB 36kB/s
     |████████████████████████████████| 204kB 18.2MB/s
  Building wheel for pyspark (setup.py) ... done

In [19]:
import os
os.environ["JAVA_HOME"] = "/usr/lib/jvm/java-8-openjdk-amd64"
os.environ["SPARK_HOME"] = "/content/spark-2.4.7-bin-hadoop2.7"

In [20]:
import findspark
findspark.init()
from pyspark.sql import SparkSession
spark = SparkSession.builder.master("local[*]").getOrCreate()

In [21]:
df = spark.read.format('csv').option("header", "True").load("train.csv")

In [26]:
%%time
df.count()

CPU times: user 167 ms, sys: 18.3 ms, total: 186 ms
Wall time: 31.8 s

74180464

In [29]:

g_df_Semana= df.groupBy('Semana').count().toPandas()

In [35]:
g_df_Semana.loc[:,'percent'] = g_df_Semana['count']/g_df_Semana['count'].sum()

In [37]:
g_df_Semana.sort_values('Semana')

  Semana     count   percent
1      3  11165207  0.150514
6      4  11009593  0.148416
3      5  10615397  0.143102
4      6  10191837  0.137392
0      7  10382849  0.139967
2      8  10406868  0.140291
5      9  10408713  0.140316